app/controllers/items_controller.rb

  def create
    item = Item.create item_params
---
INSERT INTO "items" ("name", "price", "dietary_rest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Burger"], ["price", "10.00"], ["dietary_rest", "non-vegan"], ["created_at", "2016-04-22 14:58:19.123064"], ["updated_at", "2016-04-22 14:58:19.123064"]]

  def edit
    @item = Item.find params[:id]
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]

  def show
    @item = Item.find params[:id]
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    item = Item.find params[:id]
    item.update item_params
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "items" SET "name" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["name", "Big Salad"], ["updated_at", "2016-04-22 17:54:28.497374"], ["id", 2]]

  def destroy
    Item.destroy params[:id]
---
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 4]]