app/controllers/orders_controller.rb

  def new
    @user = current_user
    @orders   = Order.new
    @item     = Item.all
    @parties  = Party.where user_id: @user.id
---
SELECT "items".* FROM "items"
SELECT "parties".* FROM "parties" WHERE "parties"."user_id" = $1  [["user_id", 2]]

  def create
    new_order = Order.create order_params
---
INSERT INTO "orders" ("party_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["party_id", 1], ["item_id", 1], ["created_at", "2016-04-22 16:19:08.996836"], ["updated_at", "2016-04-22 16:19:08.996836"]]

  def show
    @order = Order.find params[:id]
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 1]]

  def edit
    @order = Order.find params[:id]
    @user = current_user
    @item     = Item.all
    @parties = Party.where user_id: @user.id
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "items".* FROM "items"
SELECT "parties".* FROM "parties" WHERE "parties"."user_id" = $1  [["user_id", 1]]

  def update
    order = Order.find params[:id]
    order.update order_params
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "orders" SET "party_id" = $1, "item_id" = $2, "updated_at" = $3 WHERE "orders"."id" = $4  [["party_id", 4], ["item_id", 2], ["updated_at", "2016-04-22 19:35:05.783142"], ["id", 1]]

  def destroy
    Order.destroy params[:id]
---
DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 2]]