app/controllers/parties_controller.rb

  def index
    @user = current_user
    @parties = Party.where user_id: @user.id
---
SELECT "parties"."id" FROM "parties" WHERE "parties"."user_id" = $1  [["user_id", 3]]

  def create
    party = Party.create party_params.merge({user_id: current_user.id})
---
INSERT INTO "parties" ("reservation_name", "size", "table", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["reservation_name", "Jones"], ["size", "10"], ["table", "4"], ["user_id", 3], ["created_at", "2016-04-21 18:57:45.646311"], ["updated_at", "2016-04-21 18:57:45.646311"]]

  def edit
    @party = Party.find params[:id]
---
SELECT  "parties".* FROM "parties" WHERE "parties"."id" = $1 LIMIT 1  [["id", 1]]

  def show
    @party = Party.find params[:id]
---
SELECT  "parties".* FROM "parties" WHERE "parties"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    party = Party.find params[:id]
    party.update party_params.merge({user_id: current_user.id})
---
SELECT  "parties".* FROM "parties" WHERE "parties"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "parties" SET "reservation_name" = $1, "updated_at" = $2 WHERE "parties"."id" = $3  [["reservation_name", "Johns"], ["updated_at", "2016-04-24 22:14:55.035497"], ["id", 4]]

  def destroy
    Party.destroy params[:id]
---
DELETE FROM "parties" WHERE "parties"."id" = $1  [["id", 1]]